AioCMS/src/Documents/Пост/Пост.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Пост</name>
  <comment>Документ отдельного поста </comment>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>CatalogRef.Аудиозаписи</types>
      <types>CatalogRef.События</types>
      <types>CatalogRef.Сложнопост</types>
      <types>CatalogRef.Цитаты</types>
      <types>CatalogRef.Биографии</types>
      <types>CatalogRef.Термины</types>
      <types>CatalogRef.Произведения</types>
      <types>CatalogRef.Колонки</types>
      <types>CatalogRef.Сообщества</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаДвоичные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщество</name>
    <type>
      <types>CatalogRef.Сообщества</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКартинки</name>
    <type>
      <types>EnumRef.ВидыКартинок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерПоста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_НомерПоста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уровень</name>
    <type>
      <types>EnumRef.УровниПостов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тэги</name>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>CatalogRef.Тэги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AioCMS/src/Enums/ВидыКартинок/ВидыКартинок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКартинок</name>
  <enumValues>
    <name>Одиночная</name>
  </enumValues>
  <enumValues>
    <name>Галерея</name>
  </enumValues>
  <enumValues>
    <name>Термин</name>
  </enumValues>
  <enumValues>
    <name>Событие</name>
  </enumValues>
  <enumValues>
    <name>Лекция</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйНабор</name>
  </enumValues>
</mdclass:Enum>

AioCMS/src/Enums/УровниПостов/УровниПостов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниПостов</name>
  <enumValues>
    <name>Любой</name>
  </enumValues>
  <enumValues>
    <name>I</name>
  </enumValues>
  <enumValues>
    <name>II</name>
  </enumValues>
  <enumValues>
    <name>III</name>
  </enumValues>
</mdclass:Enum>

AioCMS/src/Documents/Пост/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализацияСодержания();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Пост.Сообщество КАК Сообщество,
		|	Пост.ВидКартинки КАК ВидКартинки,
		|	Пост.Уровень КАК Уровень
		|ИЗ
		|	Документ.Пост КАК Пост
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пост.Дата УБЫВ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Объект.Сообщество = ВыборкаДетальныеЗаписи.Сообщество;
			Объект.ВидКартинки = ВыборкаДетальныеЗаписи.ВидКартинки;
			Объект.Уровень = ВыборкаДетальныеЗаписи.Уровень;
		КонецЕсли;
				
	КонецЕсли;
		
	ОбновитьКартинкуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнструментарийКлиент.ЗаписатьФайлВРеквизит(Объект.Ссылка, ЭтотОбъект, "КартинкаДвоичные", "Картинка"); 

КонецПроцедуры

&НаКлиенте
Процедура СодержаниеПриИзменении(Элемент)
	СодержаниеПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Промт(Команда)
	ПромтНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинку(Команда)
	ОбновитьКартинкуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияСодержания()
	
	Если Не ЗначениеЗаполнено(Объект.ВидКартинки) Тогда
		Объект.ВидКартинки = Перечисления.ВидыКартинок.Одиночная;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Уровень) Тогда
		Объект.Уровень = ИнструментарийВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Сообщество, "СтандартныйУровеньПоста");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПромтНаСервере()	
	Записать();
	Midjourney = МетодыФормированияПостов.НовыйПромт(Объект.Ссылка);	
КонецПроцедуры

&НаСервере
Процедура СодержаниеПриИзмененииНаСервере()
	
	Записать();
	
	Если ТипЗнч(Объект.Содержание) = Тип("СправочникСсылка.Термины") Тогда
		Объект.ВидКартинки = Перечисления.ВидыКартинок.Термин;
		Объект.Уровень = Перечисления.УровниПостов.II;
	ИначеЕсли ТипЗнч(Объект.Содержание) = Тип("СправочникСсылка.События") Тогда
		Объект.ВидКартинки = Перечисления.ВидыКартинок.Событие;
		Объект.Уровень = Перечисления.УровниПостов.II;
	ИначеЕсли ТипЗнч(Объект.Содержание) = Тип("СправочникСсылка.Аудиозаписи") Тогда
		Объект.ВидКартинки  = Перечисления.ВидыКартинок.Лекция;
		Объект.Уровень		= Перечисления.УровниПостов.III;
	ИначеЕсли ТипЗнч(Объект.Содержание) = Тип("СправочникСсылка.Сложнопост") Тогда
		Объект.ВидКартинки	= Перечисления.ВидыКартинок.ПроизвольныйНабор;
		Объект.Уровень		= Перечисления.УровниПостов.III;		
	ИначеЕсли ТипЗнч(Объект.Содержание) = Тип("СправочникСсылка.Биографии") Тогда
		Объект.ВидКартинки  = Перечисления.ВидыКартинок.Биография;
		Объект.Уровень      = Перечисления.УровниПостов.IV;
	Иначе
		ИнициализацияСодержания();		
	КонецЕсли;

	ТекстПоста = МетодыФормированияПостов.СформироватьТекстПоста(Объект.Содержание);

КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуНаСервере()
	
	Попытка

		СтруктураПоста = МетодыФормированияПостов.СформироватьПост(Объект.Ссылка, , , Ложь);
		ТекстПоста     = СтруктураПоста.ТекстПоста;
		
		МассивКартинок = СтруктураПоста.МассивКартинок;
		
		Если Не МассивКартинок.Количество() = 0 Тогда
			
			Картинка = МассивКартинок[0];
			
			Если Не ТипЗнч(Картинка) = Тип("ДвоичныеДанные") Тогда			
				Картинка = Новый ДвоичныеДанные(Картинка); 
			КонецЕсли;
			
			КартинкаПоста = ПоместитьВоВременноеХранилище(Картинка, Новый УникальныйИдентификатор);
			
		КонецЕсли;
		
	Исключение
		ТекстПоста = "";
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
